# Import Modules
- Module yang digunakan adalah pandas dan numpy
- Menampilkan versi pandas dan numpy yang sedang digunakan

In [3]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

# #09: Membagi Data Frame menjadi dua secara acak        berdasarkan proporsi tertentu

### `Persiapan Data Frame`

In [11]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20, size=(n_rows, n_cols)),
                 columns=cols)
df

    A   B   C   D   E
0  17   1  18  12   5
1  16   8  15  19  14
2   3  19   5   9  18
3   8   3   2  19  12
4  13  10   9   8  15
5  10  18   9  17   7
6  19   6   5   3   4
7  14  13   3   8  18
8  19   8  11  17   5
9   4  17   5  12   3

In [5]:
df.shape

(10, 5)

* `10` artinya membuat jumlah baris 10
* `5` artinya membuat jumlah kolom 5

In [6]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (7, 5)
df_2 shape: (3, 5)

In [7]:
df_1
# Pada df_1 memiliki 7 baris dan 5 kolom

    A   B   C   D   E
3  14  18   5  19  16
6  11   1  16  13   6
5  12   2  14   8   6
1   8   7  16  16  16
2   9  16  16   6  10
9  14  13  14  15  15
4   9  18   8  11  10

In [8]:
df_2
# Pada df_2 memiliki 3 baris dan 5 kolom

   A   B  C   D   E
0  6  11  9  15   2
7  7   5  6   8  15
8  9   6  5   8  17

# Import Modules
- Module yang digunakan adalah pandas
- Menampilkan versi pandas yang sedang digunakan

In [2]:
import pandas as pd

print(pd.__version__)

1.1.3

# #10: Mengganti nama `label` kolom pada Data Frame berdasarkan pola

### `Persiapan Data Frame`

In [3]:
df =  pd.read_csv('C:/Users/Angel Lieta/Documents/PERKULIAHAN/SEMESTER 3/(6) Visualisasi Data/Belajar_PythonPandas/titanicfull.csv') 
# titanic data set
df.columns = ['Pclass', 'Survival status', 'full Name', 'Sex ', ' Age', 
              'Sib SP','Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
# Penamaan kolom sengaja berbeda-beda karena akan dilakukan studi kasus
df_backup = df.copy(deep=True)

df.head()
# Menampilkan 5 baris pertama pada tabel df

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

### Menggunakan lowercase untuk nama kolom dan mengganti spasi dengan `_`
* **str.replace(' ', '_')** berguna untuk mengubah spasi pada setiap penamaan kolom menjadi `_`
* **str.lower()** berguna untuk konversi semua karakter stringnya jadi lower atau huruf kecil (Standarisasi kolom)

In [4]:
df.columns = df.columns.str.replace(' ', '_').str.lower()
df.head()

,pclass,survival_status,full_name,sex_,_age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

### Memangkas kelebihan spasi pada nama kolom
* **df.columns** berguna modifikasi kolomnya
* **str.strip()** berguna memotong atau membuang kelebihan karakter spasi disisi kiri dan sisi kanan

In [5]:
df = df_backup.copy(deep=True)

df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_')
df.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

# Import Modules
- Module yang digunakan adalah pandas dan numpy
- Menampilkan versi pandas dan numpy yang sedang digunakan

In [6]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

# #11: Melakukan seleksi kolom dan baris pada Data Frame menggunakan `loc`

### `Persiapan Data Frame`

In [7]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20, size=(n_rows, n_cols)),
                 columns=cols)
df

    A   B   C   D   E
0  14   8  13  10  14
1   7   5   4  18   5
2  16  10  11  10   7
3  18   4   2  12  14
4   9  16   5  12   7
5  14  18   5  17  14
6   4  18  13   4  15
7   6  17  14  16  17
8  18  11   1  17   7
9   4   1   8   4   6

### Seleksi kolom dan baris menggunakan `loc`
* `loc` terbagi dalam 2 bagian besar dimana setiap bagian dibagi atau ditandai dengan tanda koma
* Bagian **pertama** adalah `[0,3,4]` mengatur baris
* Bagian **kedua** adalah `['B','E']` mengatur kolom

In [8]:
df.loc[[0,3,4], ['B','E']]

    B   E
0   8  14
3   4  14
4  16   7

### Seleksi baris dengan kondisi
*  `['B']>10` menampilkan baris yang nilai kolom B nya diatas 10
* **Pendekatan SQL**
    - Bagian kedua `['B','D','E']` mengacu kepada bagian SELECT
    - Bagian pertama `['B']>10` mengacu kepada WHERE

In [9]:
df.loc[df['B']>10, ['B','D','E']]

    B   D   E
4  16  12   7
5  18  17  14
6  18   4  15
7  17  16  17
8  11  17   7

### Slicing Data Frame dengan `loc`
* Slicing pada baris **pertama** `0:4` , slicing dari indeks ke 0 sampai indeks ke 4
* Slicing pada baris **kedua** `'B':'D'`, slicing mulai dari kolom B sampai kolom D

In [10]:
df.loc[0:4, 'B':'D']

    B   C   D
0   8  13  10
1   5   4  18
2  10  11  10
3   4   2  12
4  16   5  12

* Berbeda di **Slicing list**, dimana start indeksnya inklusif sedangkan end indeksnya ekslusif (Tidak disertakan)

# Import Modules
- Module yang digunakan adalah pandas
- Menampilkan versi pandas yang sedang digunakan

In [12]:
import pandas as pd

print(pd.__version__)

1.1.3

# #12: Membentuk kolom bertipe `datetime` dari sejumlah kolom lain pada data Frame

### `Persiapan Data Frame`

In [14]:
# mempersiapkan sebuah dictionary
data = {'day':[1, 2, 10, 25, 12],
        'month':[1, 2, 4, 5, 6],
        'year':[2000, 2001, 2010, 2015, 2020]}
# Membentuk DataFrame dari dictionary (data)
df = pd.DataFrame(data)
df

   day  month  year
0    1      1  2000
1    2      2  2001
2   10      4  2010
3   25      5  2015
4   12      6  2020

### Membentuk kolom bertipe `datetime`
1. Membuat kolom baru`['penanggalan']`
2. Spesifikasikan kolom-kolom yang mau kita sertakan untuk datetime yang dibungkus dalam sebuah list `['day', 'month', 'year']` (Tidak bisa sembarang memberi nama dan harus dalam bahasa inggris)

In [15]:
df['penanggalan'] = pd.to_datetime(df[['day', 'month', 'year']])
df

   day  month  year penanggalan
0    1      1  2000  2000-01-01
1    2      2  2001  2001-02-02
2   10      4  2010  2010-04-10
3   25      5  2015  2015-05-25
4   12      6  2020  2020-06-12

In [16]:
df.dtypes

day                     int64
month                   int64
year                    int64
penanggalan    datetime64[ns]
dtype: object